export default {
  base: {
    colorpicker: {
      confirm: 'OK',
      clear: 'Очистить'
    },
    datepicker: {
      now: 'Сейчас',
      today: 'Сегодня',
      cancel: 'Отмена',
      clear: 'Очистить',
      confirm: 'OK',
      selectDate: 'Выбрать дату',
      selectTime: 'Выбрать время',
      startDate: 'Дата начала',
      startTime: 'Время начала',
      endDate: 'Дата окончания',
      endTime: 'Время окончания',
      prevYear: 'Предыдущий год',
      nextYear: 'Следующий год',
      prevMonth: 'Предыдущий месяц',
      nextMonth: 'Следующий месяц',
      year: '',
      month1: 'Январь',
      month2: 'Февраль',
      month3: 'Март',
      month4: 'Апрель',
      month5: 'Май',
      month6: 'Июнь',
      month7: 'Июль',
      month8: 'Август',
      month9: 'Сентябрь',
      month10: 'Октябрь',
      month11: 'Ноябрь',
      month12: 'Декабрь',
      week: 'неделя',
      weeks: {
        sun: 'Вс',
        mon: 'Пн',
        tue: 'Вт',
        wed: 'Ср',
        thu: 'Чт',
        fri: 'Пт',
        sat: 'Сб'
      },
      months: {
        jan: 'Янв',
        feb: 'Фев',
        mar: 'Мар',
        apr: 'Апр',
        may: 'Май',
        jun: 'Июн',
        jul: 'Июл',
        aug: 'Авг',
        sep: 'Сен',
        oct: 'Окт',
        nov: 'Ноя',
        dec: 'Дек'
      }
    },
    select: {
      loading: 'Загрузка',
      noMatch: 'Совпадений не найдено',
      noData: 'Нет данных',
      placeholder: 'Выбрать'
    },
    cascader: {
      noMatch: 'Совпадений не найдено',
      loading: 'Загрузка',
      placeholder: 'Выбрать',
      noData: 'Нет данных'
    },
    pagination: {
      goto: 'Перейти',
      pagesize: ' на странице',
      total: 'Всего {total}',
      pageClassifier: ''
    },
    messagebox: {
      title: 'Сообщение',
      confirm: 'OK',
      cancel: 'Отмена',
      error: 'Недопустимый ввод данных'
    },
    upload: {
      deleteTip: 'Нажмите [Удалить] для удаления',
      delete: 'Удалить',
      preview: 'Предпросмотр',
      continue: 'Продолжить'
    },
    table: {
      emptyText: 'Нет данных',
      confirmFilter: 'Подтвердить',
      resetFilter: 'Сбросить',
      clearFilter: 'Все',
      sumText: 'Сумма'
    },
    tree: {
      emptyText: 'Нет данных'
    },
    transfer: {
      noMatch: 'Совпадений не найдено',
      noData: 'Нет данных',
      titles: ['Список 1', 'Список 2'],
      filterPlaceholder: 'Введите ключевое слово',
      noCheckedFormat: '{total} пунктов',
      hasCheckedFormat: '{checked}/{total} выбрано'
    },
    image: {
      error: 'Произошла ошибка'
    },
    pageHeader: {
      title: 'Назад'
    },
    popconfirm: {
      confirmButtonText: 'OK',
      cancelButtonText: 'Отмена'
    },
    empty: {
      description: 'Нет данных'
    }
  },
  custom:{
    aggsItemH:{
      '收起':'закрывать',
      '展开':'Расширять',
      '全部':'все'
    },
    aggsItemV:{
      '查看更多':'Посмотреть больше',
      '折叠隐藏':'Свернуть, чтобы скрыть'
    },
    annex:{
      '上传时间':'Время загрузки',
      '编辑':'редактировать',
      '删除':'удалить',
      '附件内容':'Содержимое вложения',
      '请输入附件标题':'Пожалуйста, введите заголовок вложения',
      '请输入附件描述':'Введите описание вложения'
    },
    author:{
      '请输入姓名':'Пожалуйста, введите имя',
      '搜索':'поиск',
      '姓名，如：张三 清华大学':'Название, например: 张三 清华大学'
    },
    cover:{
      '删除':'удалить'
    },
    keyword:{
      '关键词':'ключевые слова',
      '请输入':'Пожалуйста, введите',
      '添加':'добавить в'
    },
    authorx:{
      '新增':'Новый ',
      '信息':'информация',
      '作者':'автор',
      '请输入姓名':'Пожалуйста, введите имя',
      '请输入机构':'Пожалуйста, введите организацию',
      '第一作者':'первый автор',
      '共同第一作者':'Соавтор',
      '通讯作者':'Автор-корреспондент',
      '搜索':'поиск ',
      '保存':'сохранять',
      '姓名，如：张三 清华大学':'Название, например: 张三 清华大学',
      '上移':'двигаться вверх',
      '下移':'двигаться вниз',
      '编辑':'редактировать',
      '删除':'удалить',
      '取消':'Отмена'
    },
    institutionx:{
      '新增':'Новый ',
      '信息':'информация',
      '机构':'механизм ',
      '请输入':'Пожалуйста, введите',
      '请输入姓名':'Пожалуйста, введите имя',
      '请输入机构':'Пожалуйста, введите организацию',
      '搜索':'поиск ',
      '保存':'сохранять',
      '如：清华大学':'Такие как:：清华大学',
      '上移':'двигаться вверх',
      '下移':'двигаться вниз',
      '编辑':'редактировать',
      '删除':'удалить',
      '取消':'Отмена'
    },
    userProfile:{
      '职称':'должность',
      '职位':'Позиция',
      '荣誉称号':'Почетное звание'
    },
    xHeader:{
      '返回':'возвращаться'
    },
    readableItem:{
      '代表作':'Делегаты',
      '授权':'Авторизованный',
      '已发布':'Опубликовано',
      '未发布':'Неопубликовано',
      '作为本文作者的授权代理人提交':'Представлено как уполномоченный агент автора этой статьи.',
      '导师':'репетитор',
      '设计人':'Дизайнер',
      '发明人':'изобретатель',
      '来源预印本平台':'Исходная платформа препринтов',
      '提交时间':'Время подачи',
      '申请日':'Дата подачи заявления',
      '会议名称':'Название конференции',
      '编译者':'компилятор',
      '所属快报产品':'Принадлежность экспресс-продуктов',
      '发布日期':'Дата выпуска',
      '来源':'Источник',
      '出版年':'Год издания',
      '出版社':'издательство',
      '开始时间':'время начала',
      '结束时间':'время окончания',
      '承担机构':'Ответственная организация',
      '使用许可协议':'Лицензионное соглашение',
      '学科领域':'Предметная область',
      '获奖时间':'Время награждения',
      '获奖级别':'Уровень награды',
      '获奖等级':'Уровень награды',
      '关键词':'ключевые слова',
      '展开更多关键词':'Развернуть больше ключевых слов',
      '原文链接':'Исходная ссылка',
      '原文下载':'Оригинальная загрузка',
      '资助机构':'финансирующее агентство',
      '提交机构':'Представляющее учреждение',
      '数据中心':'центр обработки данных',
      '首次发表时间':'Впервые опубликовано',
      '发证时间':'Срок выдачи сертификата',
      '服务领域':'Зоны обслуживания',
      '所属服务':'Услуги',
      '发布时间':'Время выпуска',
      '申请号':'Номер заявки',
      '学位授予时间':'Время вручения степени',
      '学位授予单位':'Отделение присуждения ученых степеней',
      '培养单位':'учебный блок',
      '阅读全部':'Прочитать все',
      '收起':'закрывать',
      '展开更多作者':'Развернуть больше авторов',
      '申请人':'заявитель',
      '机器翻译由':'Машинный перевод'
    },
    translate:{
      'translate':'Перевести',
      'translateProgressWait': 'Перевод в процессе. Пожалуйста, подождите.',
    },
  }
};