export default {
  base: {
    colorpicker: {
      confirm: '确定',
      clear: '清空'
    },
    datepicker: {
      now: '此刻',
      today: '今天',
      cancel: '取消',
      clear: '清空',
      confirm: '确定',
      selectDate: '选择日期',
      selectTime: '选择时间',
      startDate: '开始日期',
      startTime: '开始时间',
      endDate: '结束日期',
      endTime: '结束时间',
      prevYear: '前一年',
      nextYear: '后一年',
      prevMonth: '上个月',
      nextMonth: '下个月',
      year: '年',
      month1: '1 月',
      month2: '2 月',
      month3: '3 月',
      month4: '4 月',
      month5: '5 月',
      month6: '6 月',
      month7: '7 月',
      month8: '8 月',
      month9: '9 月',
      month10: '10 月',
      month11: '11 月',
      month12: '12 月',
      // week: '周次',
      weeks: {
        sun: '日',
        mon: '一',
        tue: '二',
        wed: '三',
        thu: '四',
        fri: '五',
        sat: '六'
      },
      months: {
        jan: '一月',
        feb: '二月',
        mar: '三月',
        apr: '四月',
        may: '五月',
        jun: '六月',
        jul: '七月',
        aug: '八月',
        sep: '九月',
        oct: '十月',
        nov: '十一月',
        dec: '十二月'
      }
    },
    select: {
      loading: '加载中',
      noMatch: '无匹配数据',
      noData: '无数据',
      placeholder: '请选择'
    },
    cascader: {
      noMatch: '无匹配数据',
      loading: '加载中',
      placeholder: '请选择',
      noData: '暂无数据'
    },
    pagination: {
      goto: '前往',
      pagesize: '条/页',
      total: '共 {total} {unitText}',
      pageClassifier: '页'
    },
    messagebox: {
      title: '提示',
      confirm: '确定',
      cancel: '取消',
      error: '输入的数据不合法!'
    },
    upload: {
      deleteTip: '按 delete 键可删除',
      delete: '删除',
      preview: '查看图片',
      continue: '继续上传'
    },
    table: {
      emptyText: '暂无数据',
      confirmFilter: '筛选',
      resetFilter: '重置',
      clearFilter: '全部',
      sumText: '合计'
    },
    tree: {
      emptyText: '暂无数据'
    },
    transfer: {
      noMatch: '无匹配数据',
      noData: '无数据',
      titles: ['列表 1', '列表 2'],
      filterPlaceholder: '请输入搜索内容',
      noCheckedFormat: '共 {total} 项',
      hasCheckedFormat: '已选 {checked}/{total} 项'
    },
    image: {
      error: '加载失败'
    },
    pageHeader: {
      title: '返回'
    },
    popconfirm: {
      confirmButtonText: '确定',
      cancelButtonText: '取消'
    }
  },
  custom:{
    aggsItemH:{
      '收起':'收起',
      '展开':'展开',
      '全部':'全部'
    },
    aggsItemV:{
      '查看更多':'查看更多',
      '折叠隐藏':'折叠隐藏'
    },
    annex:{
      '上传时间':'上传时间',
      '编辑':'编辑',
      '删除':'删除',
      '附件内容':'附件内容',
      '请输入附件标题':'请输入附件标题',
      '请输入附件描述':'请输入附件描述'
    },
    author:{
      '请输入姓名':'请输入姓名',
      '搜索':'搜索',
      '姓名，如：张三 清华大学':'姓名，如：张三 清华大学'
    },
    cover:{
      '删除':'删除'
    },
    keyword:{
      '关键词':'关键词',
      '请输入':'请输入',
      '添加':'添加'
    },
    authorx:{
      '新增':'新增 ',
      '信息':'信息',
      '作者':'作者',
      '请输入姓名':'请输入姓名',
      '请输入机构':'请输入机构',
      '第一作者':'第一作者',
      '共同第一作者':'共同第一作者',
      '通讯作者':'通讯作者',
      '搜索':'搜索 ',
      '保存':'保存',
      '姓名，如：张三 清华大学':'姓名，如：张三 清华大学',
      '上移':'上移',
      '下移':'下移',
      '编辑':'编辑',
      '删除':'删除',
      '取消':'取消'
    },
    institutionx:{
      '新增':'新增 ',
      '信息':'信息',
      '机构':'机构 ',
      '请输入':'请输入',
      '请输入姓名':'请输入姓名',
      '请输入机构':'请输入机构',
      '搜索':'搜索 ',
      '保存':'保存',
      '如：清华大学':'如：清华大学',
      '上移':'上移',
      '下移':'下移',
      '编辑':'编辑',
      '删除':'删除',
      '取消':'取消'
    },
    userProfile:{
      '职称':'职称',
      '职位':'职位',
      '荣誉称号':'荣誉称号'
    },
    xHeader:{
      '返回':'返回'
    },
    readableItem:{
      '代表作':'代表作',
      '授权':'授权',
      '已发布':'已发布',
      '未发布':'未发布',
      '作为本文作者的授权代理人提交':'作为本文作者的授权代理人提交',
      '导师':'导师',
      '设计人':'设计人',
      '发明人':'发明人',
      '来源预印本平台':'来源预印本平台',
      '提交时间':'提交时间',
      '申请日':'申请日',
      '会议名称':'会议名称',
      '编译者':'编译者',
      '所属快报产品':'所属快报产品',
      '发布日期':'发布日期',
      '出版年':'出版年',
      '出版社':'出版社',
      '开始时间':'开始时间',
      '结束时间':'结束时间',
      '承担机构':'承担机构',
      '使用许可协议':'使用许可协议',
      '学科领域':'学科领域',
      '获奖时间':'获奖时间',
      '获奖级别':'获奖级别',
      '获奖等级':'获奖等级',
      '关键词':'关键词',
      '展开更多关键词':'展开更多关键词',
      '原文链接':'原文链接',
      '原文下载':'原文下载',
      '资助机构':'资助机构',
      '提交机构':'提交机构',
      '数据中心':'数据中心',
      '发证时间':'发证时间',
      '首次发表时间':'首次发表时间',
      '服务领域':'服务领域',
      '所属服务':'所属服务',
      '发布时间':'发布时间',
      '申请号':'申请号',
      '学位授予时间':'学位授予时间',
      '学位授予单位':'学位授予单位',
      '培养单位':'培养单位',
      '阅读全部':'阅读全部',
      '收起':'收起',
      '展开更多作者':'展开更多作者',
      '申请人':'申请人',
      '机器翻译由':'机器翻译由'
    },
    translate:{
      'translate':'翻译',
      'translateProgressWait': '正在翻译中，请稍后...',
    }
  }
}
